flying4fun/ESP8266_APA102_chair/src/main.cpp
void readbutton() {                                           // Read the button and increase the mode

  uint8_t b = checkButton();

  if (b == 1) {                                               // Just a click event to advance to next pattern
    gCurrentPatternNumber = (gCurrentPatternNumber + 1) % ARRAY_SIZE(gPatterns);
    if (gCurrentPatternNumber == 0) {
      gCurrentPatternNumber = (gCurrentPatternNumber + 1) % ARRAY_SIZE(gPatterns);
    }
    Serial.println(gCurrentPatternNumber);
    bWipe = 1;                                                 // Global mode change boolean
  }

  if (b == 2) {                                               // A double-click event to reset to pattern 0
    gCurrentPatternNumber = 0;
    Serial.println(gCurrentPatternNumber);
  }

  if (b == 3) {                                               // A hold event to write current pattern to EEPROM
    EEPROM.write(eepaddress, gCurrentPatternNumber);
    Serial.print("Writing: ");
    Serial.println(gCurrentPatternNumber);
  }

} // readbutton()




//--------------------[ Effects are below here ]------------------------------------------------------------------------------

void rainbow() {

  fill_rainbow(leds, NUM_LEDS, gHue, 7);                      // FastLED's built-in rainbow generator.
  EVERY_N_MILLISECONDS(20) {                                  // slowly cycle the "base color" through the rainbow
    gHue++;
  }
} // rainbow()



void rainbowWithGlitter() {

  rainbow();                                                  // Built-in FastLED rainbow, plus some random sparkly glitter.
  addGlitter(80);

} // rainbowWithGlitter()



void addGlitter(fract8 chanceOfGlitter) {

  if (random8() < chanceOfGlitter) {
    leds[ random16(NUM_LEDS) ] += CRGB::White;
  }

} // addGlitter()



void confetti() {                                             // Random colored speckles that blink in and fade smoothly.

  fadeToBlackBy(leds, NUM_LEDS, 10);
  int pos = random16(NUM_LEDS);
  leds[pos] += CHSV(gHue + random8(64), 200, 255);
  EVERY_N_MILLISECONDS(20) {                                  // slowly cycle the "base color" through the rainbow
    gHue++;
  }

} // confetti()




/*
void sinelon() {                                              // A colored dot sweeping back and forth, with fading trails.

  fadesparkle();
  //fadeToBlackBy(leds, NUM_LEDS, 20);
  int pos = beatsin16(13,0,(NUM_LEDS-1));
  leds[pos] += CHSV(gHue, 255, 192);

} // sinelon()
*/



void fadeall() {
  for (int i = 0; i < NUM_LEDS; i++) {
    leds[i].nscale8(250);
  }
} // fadeall()

void fadeallfast() {
  for (int i = 0; i < NUM_LEDS; i++) {
    leds[i].nscale8(230);
  }
} // fadeallfast()

void fadesparkle(void) {
  for (int i = 0; i < NUM_LEDS; i++) {
    leds[i].nscale8(random8(125, 250));
    leds[i] += leds[i].nscale8(random8(80, 200));
  }
} //fadesparkle

void white() {                                                  //Pick your favorite type of white below, the comments are regarding the use of WS2812 LEDs at full brightness, with no power limiting.
  for (int i = 0; i < NUM_LEDS; i++) {
    leds[i] = CRGB(255,168,70);                                 //Shane's favorite.. slightly warm/white
    //leds[i] = CRGB(255,180,80);                               //Still really good, more neutral white
    //leds[i] = CRGB::Tan;                                      //Definitely not "Tan" but better than "White"
    //leds[i] = CRGB::White;                                    //We can call this "BluWhite"
  }
} // white()


void black() {
  for (int i = 0; i < NUM_LEDS; i++) {
    leds[i] = CRGB::Black;
  }
} // black()


void flashusa() {                                             //USA USA USA USA!
  black();
  uint16_t i = random16(NUM_LEDS);
  leds[i] = CRGB::White;
  if (NUM_LEDS > 100) {
    uint16_t j = random16(NUM_LEDS);
    leds[j] = CRGB::Red;
  }
  if (NUM_LEDS > 200) {
    uint16_t k = random16(NUM_LEDS);
    leds[k] = CRGB::Blue;
  }
}

void flashfade() {
  if (bWipe == 1) {                                           // wipe the display
    black();
    bWipe = 0;
  }
  fadeall();
  uint16_t i = random16(NUM_LEDS);
  leds[i] = CRGB::White;
}

void colorbands() {
  if (bWipe == 1) {
    //movingled = 0;
    black();
    bWipe = 0;
    //bBounce = 0;
  }

  if (bBounce == 0) {
    leds[movingled] = CHSV(gHue, gSat, 255);
    movingled++;
    if (movingled == (NUM_LEDS - 1)) {
      gHue = random8();
      gSat = random8(160, 255);
      bBounce = 1;
    }
  }
  // Now go in the other direction.
  //if ((movingled > 0) && (bBounce == 1)) {
  else {
    leds[movingled] = CHSV(gHue, gSat, 255);
    movingled--;
    if (movingled == 0) {
      gHue = random8();
      gSat = random8(160, 255);
      bBounce = 0;
    }
  }
} // colorbands()


void bouncingball() {

  if (bBounce == 0) {
    fadeall();
    leds[movingled] = CHSV(gHue, 255, 255);
    if (movingled > 0) {
      leds[movingled - 1] = CRGB::Black;
    }
    movingled++;
    if (movingled == (NUM_LEDS - 1)) {
      gHue = random8();
      //gSat = random8(160, 255);
      bBounce = 1;
    }
  }
  // Reverse
  else {
    fadeall();
    leds[movingled] = CHSV(gHue, 255, 255);
    if (movingled < (NUM_LEDS - 1)) {
      leds[movingled + 1] = CRGB::Black;
    }
    movingled--;
    if (movingled == 0) {
      gHue = random8();
      //gSat = random8(160, 255);
      bBounce = 0;
    }
  }
} // bouncingball()


void snakey() {
  if (bWipe == 1) {                                             // wipe the display at pattern startup
    black();
    bWipe = 0;
  }

  if (bBounce == 0) {
    leds[movingled] = CHSV(gHue++, 255, 255);
    movingled++;
    if (movingled == (NUM_LEDS - 1)) {
      bBounce = 1;
    }
  }
  // Reverse
  else {
    leds[movingled] = CHSV(gHue++, 255, 255);
    movingled--;
    if (movingled == 0) {
      bBounce = 0;
    }
  }
  fadeall();
} // snakey()


void bpm() {                                                  // Colored stripes pulsing at a defined Beats-Per-Minute.

